// Задача 4. Напишете функция void sort_arr(void *A, int n, int dir, ftype fp),
// където А е обикновен масив от цели числа, n - размера на масива, dir -
// посоката, в която да бъде сортиран масива, и ftype - указател към функция,
// която приема масив, неговия размер и в каква посока да бъде сортиран
// входния масив. ftype трябва да сортира масива във възходящ или низходящ
// ред в зависимост от третия параметър на функцията. Принтирайте изходния
// и резултатни масиви.

#include <stdio.h>
#include <stdlib.h>
#include <conio.h>
#include "Functions.h"

int main()
{
    menu();

    return 0;
}