#include<stdio.h>

int main()
{
    float fValue1 = 4.9876543;
    double dValue1 = 7.12345678901234567890;
    double dValue2 = 18398458438583853.28;
    double dValue3 = 18398458438583853.39875937284928422;


    printf("%.7f\n", fValue1);
    printf("%.16lf\n", dValue1);
    printf("%.16e\n", dValue2);
    printf("%.16e", dValue3);

    return 0;
}

/*Дефинирайте променливи със стойност
4.9876543, 7.123456789012345678890, 18 398 458 438 583 853.28, 18 398 458 438
583 853.39875937284928422.
Изведете всяка променлива на екрана с printf()*/